EA/src/Catalogs/ВидыОбъектовМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ВидыОбъектовМ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1023</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1023</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПустаяСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Enums/ТипыОбъектовМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Catalogs/ВидыОбъектовМ/ManagerModule.bsl
Функция ПолучитьТипПоВидуОбъектаМ( ВидОбъектаМ ) Экспорт
	
	Возврат ТипЗнч( ВидОбъектаМ.ПустаяСсылка );
	
КонецФункции

// Ищет ВидОбъектаМ по Объекту
// 		Объект может быть непосредственно Объектом, Ссылкой, Строкой с ПолнымИменемМетаданных или Метаданными
Функция ПолучитьСсылкуВидаОбъектаМПоОбъекту( Объект ) Экспорт
	
	Если ТипЗнч( Объект ) = Тип( "Строка" ) Тогда
		
		// Ищем по ПолномуИмениМетаданных
		Выборка = ПолучитьВыборкуВидовОбъектовМПоПолномуИмениМетаданных( Объект );
		
	ИначеЕсли ТипЗнч( Объект ) = Тип( "ОбъектМетаданных" ) Тогда
		
		// Ищем по ПолномуИмениМетаданных
		Выборка = ПолучитьВыборкуВидовОбъектовМПоПолномуИмениМетаданных( Объект.ПолноеИмя() );
		
	Иначе
	
		Попытка
			
			// получим пустую ссылку по которой будем искать
			МассивТипов = Новый Массив;
			МассивТипов.Добавить( ТипЗнч( Объект.Ссылка ) );
			ОписаниеТипов = Новый ОписаниеТипов( МассивТипов );
			
			ПустаяСсылка = ОписаниеТипов.ПривестиЗначение( Неопределено );
			
			// теперь найдем ВидОбъектаМ по ПустойСсылке
			Выборка = ПолучитьВыборкуВидовОбъектовМПоПустойСсылке( ПустаяСсылка );
			
		Исключение
			
			Попытка
				
				// все равно попробуем найти, только через Метаданные()
				Выборка = ПолучитьВыборкуВидовОбъектовМПоПолномуИмениМетаданных( Объект.Метаданные().ПолноеИмя() );
				
			Исключение
				Возврат Неопределено;
			КонецПопытки;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьВыборкуВидовОбъектовМПоПустойСсылке( ПустаяСсылка ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр( "ПустаяСсылка", ПустаяСсылка );
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыОбъектовМ.Ссылка
	|ИЗ
	|	Справочник.ВидыОбъектовМ КАК ВидыОбъектовМ
	|ГДЕ
	|	ВидыОбъектовМ.ПометкаУдаления = ЛОЖЬ
	|	И ВидыОбъектовМ.ПустаяСсылка = &ПустаяСсылка";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция ПолучитьВыборкуВидовОбъектовМПоПолномуИмениМетаданных( ПолноеИмяМетаданных ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр( "ПолноеИмяМетаданных", ПолноеИмяМетаданных );
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыОбъектовМ.Ссылка
	|ИЗ
	|	Справочник.ВидыОбъектовМ КАК ВидыОбъектовМ
	|ГДЕ
	|	ВидыОбъектовМ.ПометкаУдаления = ЛОЖЬ
	|	И ВидыОбъектовМ.ПолноеИмяМетаданных = &ПолноеИмяМетаданных";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Функция СоздатьВидОбъектаМПоТипуИИдетификатору( ТипОбъекта, Идентификатор ) Экспорт
	
	// проверка на правильность данных
	КоллекцияМетаданных = Перечисления.ТипыОбъектовМ.ПолучитьКоллекциюМетаданныхПоТипуОбъектаМ( ТипОбъекта );
	
	Если КоллекцияМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МетаданныеОбъекта = КоллекцияМетаданных.Найти( Идентификатор );
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// создадим и заполним ВидОбъектаМ
	НовыйВидОбъекта = Справочники.ВидыОбъектовМ.СоздатьЭлемент();
	
	НовыйВидОбъекта.ТипОбъекта = ТипОбъекта;
	НовыйВидОбъекта.Идентификатор = Идентификатор;
	НовыйВидОбъекта.Наименование = ?( ПустаяСтрока( МетаданныеОбъекта.Синоним ), МетаданныеОбъекта.Имя, МетаданныеОбъекта.Синоним );
	
	Попытка
		НовыйВидОбъекта.Записать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат НовыйВидОбъекта.Ссылка;
	
КонецФункции
